/* ==================================================================== */
/* ================= System-X Master Control Program ================== */
/* ==================================================================== */


static const char __version[]="\0$VER: SX-MCP 1.06b [eSSeXX] 68020 ("__DATE__")";

/* msgs to nodes */

#define CLOSESCREEN	1
#define OPENSCREEN	2
#define SHUTDOWN	3
#define KICKUSER	4
#define CHAT		5
#define SERIALQUERY	6
#define TOFRONT		8

/* msgs to MCP */

#define REGO		1
#define UNREGO		2
#define USERLOGIN	3
#define USERLOGOUT	4
#define USERACTIVE	5
#define MENUPO		6
#define UPDATEUSER	7
#define PASSWORD	8
#define PAGEDFLAG	9
#define QUERYSYSOP	10
#define REPORTCPS	11
#define APPENDFILE	12
#define NODESPO		14
#define DOWNLOADFIN	15
#define UPLOADFIN	16
#define LOADMCPCFG	17
#define DDNODES		18
#define SXTODD		19

#include <stdlib.h>
#include <string.h>
#include <exec/memory.h>
#include <proto/exec.h>
#include <proto/dos.h>
#include <proto/intuition.h>
#include <proto/graphics.h>
#include <proto/icon.h>
#include <proto/wb.h>
#include <proto/gadtools.h>
#include <intuition/intuition.h>
#include <intuition/screens.h>
#include <libraries/gadtools.h>
#include <dos/dos.h>
#include <dos/dostags.h>
#include <workbench/workbench.h>
#include <workbench/icon.h>
#include <libraries/reqtools.h>
#include <proto/reqtools.h>
#include "SX-MCP.h"

/* typedef a 32-bit type */
#ifdef __alpha
typedef unsigned int UINT4;
#else
typedef unsigned long int UINT4;
#endif

/* Data structure for MD5 (Message-Digest) computation */
typedef struct {
  UINT4 buf[4];                                    /* scratch buffer */
  UINT4 i[2];                   /* number of _bits_ handled mod 2^64 */
  unsigned char in[64];                              /* input buffer */
} MD5_CTX;

extern void MD5Init(MD5_CTX *mdContext);
extern void MD5Update(MD5_CTX *mdContext, unsigned char *bug, unsigned int len);
extern void MD5Final(unsigned char digest[16], MD5_CTX *mdContext);
extern void Transform(UINT4 *buf, UINT4 *in);

extern struct Image sysxbbsImage;
extern struct Image p1Image;
extern struct Image p2Image;

extern void SmoothInfoBox(void);
extern void Smooth(int left, int top);
extern void TickON(void);
extern void TickOFF(void);
extern void Pic(int left, int top);
extern void BevBox(char inv, int left, int top, int right, int bot, char * s, int textpen);
extern void FadeOut(void);

void HandleMsg(void);
void CallerLog(struct CallerLog *Caller);
void CheckRexx(void);
void UpdateDisplay(int i, char sel);
void MainConfig(void);
void AppendFile(char *file, char *buffer, long size);
void CheckWin(void);
void StartWindow(void);
void HandleGad(struct Gadget *gad, UWORD code);
void ShowAll(void);
void ShowNode(UWORD node);
void UserInfo(int cls);
void ShowList(UWORD which);
void About(void);
void StartIcon(void);
void LoadMenus(void);
void FlushMenus(void);
void MsgToNode(int cmd, int node);
UWORD ActiveNodes(void);
UWORD OnlineNodes(void);
void SXBase_To_DDBase(struct UserData *TUser, struct SXUserStruct *TSXUser, struct UserIndexStruct *TIndex, struct DayDream_User *DDUser);
void ShutAll(void);


struct McpStruct
{
	UWORD	leftedge,
		topedge,
		flags;		/* BITS: 0=iconify, 1=realnames */
	char	text1[16],
		cmd1[48],
		text2[16],
		cmd2[48];
	UBYTE	listsize,
		reserve;
	char	awayreason[74];
} mcp;

struct NodeMessage
{
	struct Message Msg;
	UWORD command;
	UWORD misc;
	long data1;
	long data2;
	long data3;
	long data4;
} themsg;

struct DDNodeStruct
{
	struct DDNodeStruct *ns_Prev;
	struct DDNodeStruct *ns_Next;
	struct DayDream_User *ns_ub;
	UWORD ns_Unused;
	UBYTE ns_Nodenumber;
	UBYTE ns_Flags;
	struct Screen *ns_Screen;
	APTR ns_Activity;
	ULONG ns_ConnectionRate;
	APTR ns_Pagereason;
	struct DayDream_Multinode *ns_Currnode;
} ddnodes[34];

struct node_struct
{						/* offset DEC	*/
	APTR next;				/*	0	*/
	struct UserData *User;			/*	4	*/
	struct UserIndexStruct *UserIndex;	/*	8	*/
	struct SXUserStruct *SXUser;		/*	12	*/
	char *action;				/*	16	*/
	char *filename;				/*	20	*/
	long baud;				/*	24	*/
	long loginsecs;				/*	28	*/
	UWORD number;				/*	32	*/
	UBYTE actionnumber;			/*	34	*/
	UBYTE active;				/*	35	*/
	UBYTE useron;				/*	36	*/
	UBYTE paged;				/*	37	*/
} sxnodes[34];

struct MainStruct MainCfg;
struct UserData User;

struct MenusStruct
{
	char name[30];
	char *byso;
	long size;
} menus[202];

struct XferLog
{
	UWORD	user_slot;
	UBYTE	conf,
		filearea;
	char	filename[32];
	long	size,
		baud,
		cps,
		time;
	UBYTE	node;
	char	res[7];
} Xfer;

struct CallerLog
{
	UWORD	user_slot,
		node;
	long	time_login,
		time_logout,
		seconds_online,
		bytes_uploaded,
		bytes_downloaded;
	UWORD	files_uploaded,
		files_downloaded,
		messages;
	long	baud,
		flags;
	UBYTE	logout_mode; 	/*	0 = normal		*/
	char	res[25];	/*	1 = lost carrier	*/
};				/*	2 = auto logoff after download*/

struct DayDream_User
{
  char user_realname[26];
  char user_handle[26];
  char user_organization[26];
  char user_zipcity[21];
  char user_voicephone[21];
  char user_password[16];
  UBYTE	user_screenlength;
  UBYTE	user_protocol;
  ULONG	user_toggles;
  char user_signature[45];
  UBYTE	freeslot1;
  ULONG	user_ulbytes;
  ULONG	user_dlbytes;
